# 3. Limpieza de Datos

## Librerias

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [24]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
df = pd.read_csv(url)

In [7]:
df.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

## 3.1 Crear un dataframe

In [9]:
df = pd.DataFrame()

In [13]:
df['Name'] = ['Jacky Jasckon', 'Steve Stevenson']
df['Age'] = [38, 25]
df['Driver'] = [True, False]

In [14]:
df

              Name  Age  Driver
0    Jacky Jasckon   38    True
1  Steve Stevenson   25   False

In [18]:
# Agregar nuevos registros

new_row = pd.Series(['Mooley Moon', 40, True], index=['Name', 'Age', 'Driver'])

In [20]:
df.append(new_row, ignore_index=True)

              Name  Age  Driver
0    Jacky Jasckon   38    True
1  Steve Stevenson   25   False
2      Mooley Moon   40    True

## 3.2 Describiendo los datos

In [22]:
# Dimensiones del dataset

df.shape

(2, 3)

In [25]:
# Mostrar estadisticas

df.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

## 3.3 Navegando en los dataframes

In [26]:
# Seleccionar la primera fila

df.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [27]:
# Seleccionar tres filas

df.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [29]:
# Ajustando el indice

df = df.set_index(df['Name'])

In [35]:
df.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

## 3.4 Seleccionando filas basadas en condicionales

In [38]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
df = pd.read_csv(url)

In [48]:
# Aplicando condicionales

df[df['Sex'] == 'female'].head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1

In [49]:
# Aplicando varios condicionales

df[(df['Sex']=='female') & (df['Survived']==1)].head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1
11,"Astor, Mrs John Jacob (Madeleine Talmadge Force)",1st,19.0,female,1,1
12,"Aubert, Mrs Leontine Pauline",1st,NaN,female,1,1

## 3.5 Remplazar valores

In [52]:
# Remplazar varios valores a la vez

df['Sex'].replace(['female', 'male'], ['woman', 'man'])

0       woman
1       woman
2         man
3       woman
4         man
        ...
1308      man
1309      man
1310      man
1311      man
1312      man
Name: Sex, Length: 1313, dtype: object

In [53]:
# Remplazar valores en todo el dataframe

df.replace(1, 'One')

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,One,One
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,One
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,One
4,"Allison, Master Hudson Trevor",1st,0.92,male,One,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.0,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.0,male,0,0
1310,"Zenni, Mr Philip",3rd,22.0,male,0,0
1311,"Lievens, Mr Rene",3rd,24.0,male,0,0
1312,"Zimmerman, Leo",3rd,29.0,male,0,0

## 3.6 Renombrar columnas

In [55]:
df.rename(columns={'PClass':'Passenger Class'})

,Name,Passenger Class,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,"Zimmerman, Leo",3rd,29.00,male,0,0

## 3.7 Encontrando estadisticas descriptivas

In [68]:
print('Máximo:', df['Age'].max())
print('Mínimo:', df['Age'].min())
print('Promedio:', df['Age'].mean())
print('Mediana:', df['Age'].median())
print('Desv Estándar:', df['Age'].std())
print('Suma:', df['Age'].sum())
print('Conteo:', df['Age'].count())

Máximo: 71.0
Mínimo: 0.17
Promedio: 30.397989417989415
Mediana: 28.0
Desv Estándar: 14.259048710359023
Suma: 22980.88
Conteo: 756

## 3.8 Encontrando valores únicos

In [69]:
df['Sex'].unique()

array(['female', 'male'], dtype=object)

In [71]:
pd.DataFdf['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64